In [2]:
import sqlalchemy
engine = sqlalchemy.create_engine('postgresql://bob:1234@localhost:5432/dvdrental')
engine.execution_options(isolation_level="AUTOCOMMIT")
%load_ext sql
%sql $engine.url

'Connected: bob@dvdrental'

# Time/Date functions: Extract
Postgres has support for the full set of SQL [Date and Time types](https://www.postgresql.org/docs/15/datatype-datetime.html). The [EXTRACT](https://www.postgresql.org/docs/15/functions-datetime.html#FUNCTIONS-DATETIME-EXTRACT) function allows us to extract parts from a date (year, month, day of the month or of the week, hour, minutes, etc). The general syntax for using this function would be:

```sql
SELECT extract(day from column_with_date)
FROM table_1;
```

That would return the day of the month of the `column_with_date` for the first 10 rows. Instead of `day` we could have also used any of the time units mentioned at the beginning. Let's see an example:

In [6]:
%%sql
SELECT
    extract(day from payment_date) AS day,
    extract(month from payment_date) AS month,
    extract(year from payment_date) AS year
FROM payment
LIMIT 10;

 * postgresql://bob:***@localhost:5432/dvdrental
10 rows affected.

[(Decimal('15'), Decimal('2'), Decimal('2007')),
 (Decimal('16'), Decimal('2'), Decimal('2007')),
 (Decimal('16'), Decimal('2'), Decimal('2007')),
 (Decimal('19'), Decimal('2'), Decimal('2007')),
 (Decimal('20'), Decimal('2'), Decimal('2007')),
 (Decimal('21'), Decimal('2'), Decimal('2007')),
 (Decimal('17'), Decimal('2'), Decimal('2007')),
 (Decimal('20'), Decimal('2'), Decimal('2007')),
 (Decimal('20'), Decimal('2'), Decimal('2007')),
 (Decimal('16'), Decimal('2'), Decimal('2007'))]

Now let's say we're interested in knowing about the total amount of the payments per month:

In [8]:
%%sql
SELECT sum(amount), extract(month from payment_date) AS month
FROM payment
GROUP BY month;

 * postgresql://bob:***@localhost:5432/dvdrental
4 rows affected.

[(Decimal('8351.84'), Decimal('2')),
 (Decimal('23886.56'), Decimal('3')),
 (Decimal('514.18'), Decimal('5')),
 (Decimal('28559.46'), Decimal('4'))]